<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Laboratorio 20 </title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
.Code { font-family:"Courier New", Courier, monospace; font-size:12px; color:#003366; background-color:#FFFFCC}
.Estilo1 {font-family: Arial, Helvetica, sans-serif}
.Estilo4 {font-family: Arial, Helvetica, sans-serif; color: #000000; }
.Estilo3 {font-family: Arial, Helvetica, sans-serif; font-size: 9px; }
body {
	margin-top: 0px;
	margin-bottom: 0px;
}
.Estilo5 {font-size: 14px}
.Estilo6 {font-family: Arial, Helvetica, sans-serif; font-size: 14px; }
-->
</style>
</head>

<body>
<table width="98%" border="0">
  <tr>
    <td><div align="right"><img src="../imagenes/actividades.jpg" width="600" height="50"></div></td>
  </tr>
  <tr>
    <td><p align="left" class="Estilo4"><strong>Laboratorio 17: Creando ayuda en l&iacute;nea <br>
</strong><strong><br>
</strong></p>
    </td></tr>
  <tr>
    <td class="Estilo1 Estilo5"><p class="Estilo6"><strong><img src="../imagenes/objetivos.jpg" width="600" height="50"></strong></p>
      <p class="Estilo6"><br>
En esta pr&aacute;ctica conoceremos un m&eacute;todo para crear ayuda en                l&iacute;nea para nuestras aplicaciones de Visual Studio .Net 2005.<br>
        <br>
        <br>
      <img src="../imagenes/instrucciones.jpg" width="600" height="50"></p>
      <p class="Estilo6"><strong> </strong></p>
      <p>Visual Studio utiliza un formato de archivo llamado Compressed HTML Help creado por Microsoft. Este archivo es un conjunto de archivos .html y un archivo de metadatos que tiene el &iacute;ndice y algunos otros datos importantes. </p>
      <p><img src="../imagenes/ball.gif" alt="" height="8" width="8"> Copia los siguientes archivos a tu directorio de trabajo: </p>
      <br>
      <div align="center"><a href="../recursos/HelpMaker.exe"> <img src="../imagenes/lab21-imgHM.png"> </a> </div>
      <p>HelpMaker es un programa OpenSource que nos permite crear diferentes archivos de ayuda. La p&aacute;gina principal de HelpMaker se encuentra en <a href="http://www.vizacc.com/">http://www.vizacc.com/</a>, si quieres aprender m&aacute;s sobre esta herramienta puedes entrar a ese site. </p>
      <p>Para utilizar ayuda en l&iacute;nea con Visual Studio .Net 2005 los archivos deben estar en formato chm.</p>
      <p>Instala HelpMaker utilizando el archivo que descargaste. Abrelo y crea un nuevo proyecto con File -&gt; New o presionando Ctrl + N. Aparecer&aacute; una ventana similar a la siguiente, presiona Next.</p>
      <div align="center"> <img src="../imagenes/lab21-img1.png"> </div>
      <p>Aparecer&aacute; una segunda ventana en la que te piden la ruta en la que se va a guardar tu archivo de ayuda y te piden tambi&eacute;n el nombre del proyecto. Guarda el archivo en una carpeta en la que tambi&eacute;n guardar&aacute;s el proyecto m&aacute;s tarde y ponle como nombre Laboratorio22 (f&iacute;jate que no tiene espacio). Presiona Next.</p>
      <div align="center"> <img src="../imagenes/lab21-img2.png"> </div>
      <p>En la siguiente pantalla aparece el esquema de la ayuda, en este laboratorio vamos a utilizar un esquema como el siguiente, escribe todas las l&iacute;neas que se ven en la fotograf&iacute;a y luego ve seleccionando una por una las l&iacute;neas e idéntalas utilizando los botones de la derecha.</p>
      <div align="center"> <img src="../imagenes/lab21-img3.png"> </div>
      <p>Aparecer&aacute; la pantalla principal, utilizando el explorador de la 
		izquierda puedes seleccionar alg&uacute;n archivo y modificarlo utilizando el editor a la derecha. El editor es muy simple y no cuenta con algunas opciones avanzadas, por ejemplo, no se pueden poner acentos. Si quieres poner acentos puedes escribir el texto en notepad y despu&eacute;s copiar y pegar a la ventana de edici&oacute;n. Escribe algunas l&iacute;neas en cada tema, en el editor puedes agregar texto con formato (utilizando los botones en la parte superior, puedes agregar algunos emoticons y puedes agregar hyperlinks e im&aacute;genes (utilizando el bot&oacute;n de la cadena y el bot&oacute;n que tiene una hoja con una 
		imagen de la barra de herramientas). </p>
      <div align="center"> <img src="../imagenes/lab21-img4.png"> </div>
      <p>Ahora haz cilck derecho sobre la barra de navegaci&oacute;n a la izquierda y selecciona Power Editor.</p>
      <div align="center"> <img src="../imagenes/lab21-img5.png"> </div>
      <p>En el power editor puedes poner un <strong>Topic ID </strong>(es el nombre de archivo con el que se va a guardar) y un <strong>Context Number </strong>con el que vamos a identificarlo en Visual Studio. Cambia los valores del Context Number a los que se ven en la fotograf&iacute;a para que luego los referenciemos desde Visual Studio. </p>
      <div align="center"> <img src="../imagenes/lab21-img7.png"> </div>
      <p>Una vez que hayas terminado de cambiar eso, selecciona el tema de introducci&oacute;n y da click derecho sobre &eacute;l. Selecciona <strong>Set As Default Topic </strong>para que al abrir la ayuda sea el que se despliegue por default. </p>
      <div align="center"> <img src="../imagenes/lab21-img6.png"> </div>
      <p>Ahora selecciona el proyecto Laboratorio22 en el explorador de proyectos, aparecer&aacute; una pantalla en la que te permiten compilar la ayuda en l&iacute;nea. Haz click sobre el bot&oacute;n <strong>Compile</strong>.</p>
      <div align="center"> <img src="../imagenes/lab21-img8.png"> </div>
      <p> Aparecer&aacute; una pantalla donde te dice que se est&aacute; compilando y al terminar te permite explorar el directorio en que se guardaron los archivos. Presiona el bot&oacute;n <strong>Explore Help Directory</strong> y aparecer&aacute; el directorio con varios archivos html y un archivo chm. Copia el archivo chm a la carpeta debug de tu aplicaci&oacute;n, este es el archivo de ayuda comprimido que necesitas agregar a tu proyecto para que se muestre la ayuda en l&iacute;nea. </p>
      <div align="center"> <img src="../imagenes/lab21-img9.png"> </div>
      <p><font color="#3366ff" face="Courier New, Courier, monospace"><b><img src="../imagenes/vi_rombo.gif" alt="" height="14" width="14"> </b></font><b>Creando ayuda sensible al contexto.</b><br>
          <br>
          <img src="../imagenes/ball.gif" alt="" height="8" width="8"> Crea un nuevo proyecto en Visual Basic de tipo <strong>Windows Application</strong></p>
      <p><img src="../imagenes/ball.gif" alt="" height="8" width="8"> Pon un control de tipo HelpProvider y varios controles como TextBox, CheckBox, List o ComboBox, el HelpProvider nos permite comunicarnos con el archivo chm que acabamos de crear. </p>
      <div align="center"> <img src="../imagenes/lab21-img10.png"> </div>
      <p>El HelpProvider necesita que configuremos en d&oacute;nde va a encontrar el archivo de ayuda que va a utilizar, por lo que es 
        necesario que pongas el siguiente c&oacute;digo en el m&eacute;todo load:</p>
      <pre class="Code">
    Private Sub Form1_Load(ByVal sender As System.Object, ByVal e As System.EventArgs) _
    Handles MyBase.Load
        Dim path As String = System.AppDomain.CurrentDomain.BaseDirectory()
        HelpProvider1.HelpNamespace = path & "\laboratorio22.chm"
    End Sub
      </pre>
      <p><img src="../imagenes/ball.gif" alt="" height="8" width="8"> En cada uno de los controles que agregaste modifica la propiedad <strong>HelpNavigatorOnHelpProvider1 a TopicID </strong>y la propiedad <strong>HelpKeywordOnHelpProvider1 al Context Number </strong>que seleccionaste en el archivo de ayuda. </p>
      <p><img src="../imagenes/ball.gif" alt="" height="8" width="8"> Ejecuta tu aplicaci&oacute;n y prueba <b>F1 </b>en los diferentes contextos
        que definiste. Observa qu&eacute; ocurre si oprimes <b>F1 </b>en un control que <b>no</b> tiene <b>HelpContextID</b> (es decir, que vale 0).<br>
      </p>
      <p class="Estilo6"><img src="../imagenes/especificaciones.jpg" width="600" height="50"></p>
      <p class="Estilo6"><strong>La calificaci&oacute;n de esta actividad     es de 
		carácter individual.<br>
          <br>
Env&iacute;a el laboratorio por este medio , archivo lab20 +  matricula.zip.</strong></p>
      <p class="Estilo6">&nbsp;</p>    </td>
  </tr>
  <tr>
    <td><p align="center" class="Estilo1 Estilo4 Estilo5">&nbsp;</p>      </td>
  </tr>
</table>

<map name="Map"><area shape="rect" coords="5,6,103,123" href="../../semana7/lab11/proveedores.csv">
<area shape="rect" coords="130,7,229,123" href="../../semana7/lab11/proyectos.csv">
<area shape="rect" coords="255,7,352,122" href="../../semana7/lab11/entregan.csv">
<area shape="rect" coords="373,5,474,122" href="../../semana7/lab11/materiales.csv">
</map></body>
</html>
